app/Controllers/Orang.php

    public function index()
    {
        $currrentPage = $this->request->getVar('page_orang') ? $this->request->getVar('page_orang') : 1;
        // d($this->request->getVar('keyword'));

        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $this->orangModel->search($keyword);
        } else {
            $orang = $this->orangModel;
        }

        $data = [
            'judul' => 'Daftar Orang',
            // 'orang' => $this->orangModel->findAll()
            'orang' => $orang->paginate(6, 'orang'),
---
SELECT *
FROM `orang`
 LIMIT 78, 6
SELECT COUNT(*) AS `numrows`
FROM `orang`