app/Models/KomikModel.php

SELECT *
FROM `komik`
---
    public function getKomik($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();